In [1]:
! pip install pymysql

Requirement already satisfied: pymysql in c:\users\shahrukh khan\anaconda3\lib\site-packages (1.0.2)

In [2]:
! pip install plotly

Requirement already satisfied: plotly in c:\users\shahrukh khan\anaconda3\lib\site-packages (5.8.0)
Requirement already satisfied: tenacity>=6.2.0 in c:\users\shahrukh khan\anaconda3\lib\site-packages (from plotly) (8.0.1)

In [3]:
import pandas as pd
import seaborn as sn
import plotly.express as px
import numpy as np
import plotly.graph_objects as go
import math 
import pymysql
pd.set_option("display.max_column", None)

In [4]:
dbcon = pymysql.connect(host ="localhost",user = "root",password = "srk123",database = "titanic")

In [5]:
dbcon

In [7]:
pd.read_sql_query("""select * from titanic where survived""",dbcon,parse_dates = True)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
1,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,,S
2,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
3,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,,S
4,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,,C
...,...,...,...,...,...,...,...,...,...,...,...,...
337,876,1,3,"Najib, Miss. Adele Kiamie ""Jane""""""",female,15,0,0,2667,7.2250,,C
338,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56,0,1,11767,83.1583,C50,C
339,881,1,2,"Shelley, Mrs. William (Imanita Parrish Hall)",female,25,0,1,230433,26.0000,,S
340,888,1,1,"Graham, Miss. Margaret Edith",female,19,0,0,112053,30.0000,B42,S
341,890,1,1,"Behr, Mr. Karl Howell",male,26,0,0,111369,30.0000,C148,C

In [8]:
df = pd.read_sql_query("""select * from titanic where survived""",dbcon,parse_dates = True)
df.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
1,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,,S
2,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
3,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27,0,2,347742,11.1333,,S
4,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14,1,0,237736,30.0708,,C

In [9]:
df.info

<bound method DataFrame.info of      PassengerId  Survived  Pclass  \
0              2         1       1
1              3         1       3
2              4         1       1
3              9         1       3
4             10         1       2
..           ...       ...     ...
337          876         1       3
338          880         1       1
339          881         1       2
340          888         1       1
341          890         1       1

                                                  Name     Sex  Age  SibSp  \
0    Cumings, Mrs. John Bradley (Florence Briggs Th...  female   38      1
1                               Heikkinen, Miss. Laina  female   26      0
2         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female   35      1
3    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female   27      0
4                  Nasser, Mrs. Nicholas (Adele Achem)  female   14      1
..                                                 ...     ...  ...    ...
337                 Najib, Miss. Adele Kiamie "Jane"""  female   15      0
338      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female   56      0
339       Shelley, Mrs. William (Imanita Parrish Hall)  female   25      0
340                       Graham, Miss. Margaret Edith  female   19      0
341                              Behr, Mr. Karl Howell    male   26      0

     Parch            Ticket     Fare Cabin Embarked
0        0          PC 17599  71.2833   C85        C
1        0  STON/O2. 3101282   7.9250              S
2        0            113803  53.1000  C123        S
3        2            347742  11.1333              S
4        0            237736  30.0708              C
..     ...               ...      ...   ...      ...
337      0              2667   7.2250              C
338      1             11767  83.1583   C50        C
339      1            230433  26.0000              S
340      0            112053  30.0000   B42        S
341      0            111369  30.0000  C148        C

[342 rows x 12 columns]>

In [11]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,342.000000,342.0,342.000000,342.000000,342.000000,342.000000,342.000000
mean,444.368421,1.0,1.950292,24.035088,0.473684,0.464912,48.395408
std,252.358840,0.0,0.863321,17.122774,0.708688,0.771712,66.596998
min,2.000000,1.0,1.000000,0.000000,0.000000,0.000000,0.000000
25%,250.750000,1.0,1.000000,7.250000,0.000000,0.000000,12.475000
50%,439.500000,1.0,2.000000,25.000000,0.000000,0.000000,26.000000
75%,651.500000,1.0,3.000000,35.000000,1.000000,1.000000,57.000000
max,890.000000,1.0,3.000000,80.000000,4.000000,5.000000,512.329200

In [15]:
sns.countplot(x= "survived", data= df)

NameError: name 'sns' is not defined

In [13]:
!pip install sns

Collecting sns
  Downloading sns-0.1.tar.gz (2.1 kB)
Building wheels for collected packages: sns
  Building wheel for sns (setup.py): started
  Building wheel for sns (setup.py): finished with status 'done'
  Created wheel for sns: filename=sns-0.1-py3-none-any.whl size=2661 sha256=66cfd541a90392ad60a1c261075266b1f24f41ee8846405311c933b2c936fd70
  Stored in directory: c:\users\shahrukh khan\appdata\local\pip\cache\wheels\ff\12\fa\4d724fdfed493cfe12b239ae9a0bc26b2fd85bb7dc9ecde7c3
Successfully built sns
Installing collected packages: sns
Successfully installed sns-0.1

In [16]:
sns.countplot(x= "survived", data= df)

NameError: name 'sns' is not defined